# Hp Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
SymbolTypeId..::..Hp Property
SymbolTypeId Class See Also
---
Symbol hp, indicating unit Horsepower.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2021
# Syntax
C#
---
```text
public static ForgeTypeId Hp { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property Hp As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ Hp {
	ForgeTypeId^ get ();
}
```

# See Also
SymbolTypeId Class
Autodesk.Revit.DB Namespace